In [71]:
# https://drive.google.com/file/d/1RHLwrS-c5sPgr-TmK_cafpWb91ZlvU5Y/view
import pandas as pd

### Question 1.

1. pd.DataFrame()

In [13]:
df = pd.DataFrame({ "a": [1,2,3,5], "b": [9,8,7,6] })

2. pd.Series()

In [7]:
pd.Series([2,4,6,8,10])

0     2
1     4
2     6
3     8
4    10
dtype: int64

3. pd.head()

In [14]:
df.head()

   a  b
0  1  9
1  2  8
2  3  7
3  5  6

4. pd.describe()

In [15]:
df.describe()

              a         b
count  4.000000  4.000000
mean   2.750000  7.500000
std    1.707825  1.290994
min    1.000000  6.000000
25%    1.750000  6.750000
50%    2.500000  7.500000
75%    3.500000  8.250000
max    5.000000  9.000000

5. df.groupby()

In [17]:
list(df.groupby('a'))

[(1,
     a  b
  0  1  9),
 (2,
     a  b
  1  2  8),
 (3,
     a  b
  2  3  7),
 (5,
     a  b
  3  5  6)]

### Question 2.

In [18]:
df1 = pd.DataFrame({ "a": [1,2,3,5], "b": [9,8,7,6], "c": [10, 11, 12, 13] })

In [21]:
new_index = pd.RangeIndex(start=1, step=2, stop=len(df1)*2)
new_df = df1.set_index(new_index)

print(new_df)

   a  b   c
1  1  9  10
3  2  8  11
5  3  7  12
7  5  6  13

### Question 3.

In [3]:
df3 = pd.DataFrame({ "Values": [10, 20, 30, 40, 50]})

In [10]:
df3['Values'][0:3].sum()

60

### Question 4.

In [14]:
df4 = pd.DataFrame({ "Text": ["Madhu", "Sudan", "Soni"]})

In [20]:
df4['Word_Count'] = [len(data) for data in df4["Text"]]

In [21]:
df4

    Text  Word_Count
0  Madhu           5
1  Sudan           5
2   Soni           4

### Question 5.

In [22]:
df5 = pd.DataFrame({ "a": ["Madhu", "Sudan", "Soni"], "b": ["Aryan", "Soni", ""]})

1. DataFrame.size() given count of all fields, means 2 columns & 3 rows will be 2 * 3 = 6

In [28]:
df5.size

6

2. DataFrame.shape()returns a tuple with no. of row & column

In [29]:
df5.shape

(3, 2)

### Question 6.

In [34]:
df6 = pd.read_excel("./files/Orders-With Nulls.xlsx")
df6.head()

,Order ID,Order Date,Order Quantity,Sales,Ship Mode,Profit,Unit Price,Customer Name,Customer Segment,Product Category
0,3,2010-10-13,6,261.5400,Regular Air,-213.250,38.94,Muhammed MacIntyre,Small Business,Office Supplies
1,6,2012-02-20,2,6.9300,Regular Air,-4.640,2.08,Ruben Dartt,Corporate,Office Supplies
2,32,2011-07-15,26,2808.0800,Regular Air,1054.820,107.53,Liz Pelletier,Corporate,Furniture
3,32,2011-07-15,24,1761.4000,Delivery Truck,-1748.560,70.89,Liz Pelletier,Corporate,Furniture
4,32,2011-07-15,23,160.2335,Regular Air,-85.129,7.99,Liz Pelletier,Corporate,Technology

### Question 7.

In [41]:
df7 = pd.DataFrame({'Email':["madhu@gmail.com", "aryan@gmail.com", "soni@gmail.com"]})

In [42]:
df7["username"] = [email.split("@")[0] for email in df7["Email"]]

In [43]:
df7

             Email username
0  madhu@gmail.com    madhu
1  aryan@gmail.com    aryan
2   soni@gmail.com     soni

### Question 8.

In [48]:
df8 = pd.DataFrame({"a": [3,8,6,2,9], "b": [5,2,9,3,1], "c": [1,7,4,5,2]})

Example 1.

In [62]:
df8[(df8.a > 5) & (df8.b < 10)]

   a  b  c
1  8  2  7
2  6  9  4
4  9  1  2

Example 2.

In [64]:
def filter_data_frame(df):
    return df.query('a > 5 and b < 10')
    
print(filter_data_frame(df8))

   a  b  c
1  8  2  7
2  6  9  4
4  9  1  2

### Question 9.

In [69]:
df9 = pd.DataFrame({'Values': [1,2,3,4,5,6,7,8,9]})
print("mean", df9.Values.mean())
print("median", df9.Values.median())
print("std", df9.Values.std())

mean 5.0
median 5.0
std 2.7386127875258306

### Question 10.

In [139]:
df10 = pd.DataFrame({"Sales": [], "Date": []}) ## pending due to some confusion

### Question 11.

In [132]:
from datetime import datetime

df11 = pd.DataFrame({"Date": ["2023-01-01", "2023-01-02", "2023-01-03", "2023-01-04", "2023-01-05", "2023-03-08", "2023-03-10", "2023-03-11"]})

In [126]:
weekdays = ["Mon", "Tue", "Wed", "Thus", "Fri", "Sat", "Sun"] 
df11['weekday'] = [weekdays[datetime.strptime(date_obj, "%Y-%m-%d").weekday()] for date_obj in df11.Date] 
df11

         Date weekday
0  2023-01-01     Sun
1  2023-01-02     Mon
2  2023-01-03     Tue
3  2023-01-04     Wed
4  2023-01-05    Thus
5  2023-03-08     Wed
6  2023-03-10     Fri
7  2023-03-11     Sat

### Question 12.

In [142]:
df12 = pd.DataFrame({"Date": ["2023-01-01", "2023-01-02", "2023-01-03", "2023-01-04", "2023-01-05","2023-02-01", "2023-02-02", "2023-02-03", "2023-02-04", "2023-02-05", "2023-03-08", "2023-03-10", "2023-03-11"]})

df12.Date = [datetime.strptime(element, "%Y-%m-%d") for element in df12.Date]

from_date = datetime.strptime('2023-01-01', "%Y-%m-%d")
to_date = datetime.strptime('2023-01-31', "%Y-%m-%d")

df12[(df12.Date >= from_date) & (df12.Date <= to_date)]

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05